[
    {
        "year_group": "Year 1",
        "key_stage": "KS1",
        "subject": "Science",
        "topic_title": "Plants",
        "method_explanation": "Students identify and name common plants, including deciduous and evergreen trees, and learn the basic structure of flowering plants (leaves, petals, roots, trunk).",
        "image_generated_by_dalle": "A simple illustration showing the parts of a flowering plant, such as roots, stem, leaves, and flowers.",
        "interactive_activities": [
            "Take a nature walk and identify different types of plants and trees, discussing whether they are deciduous or evergreen.",
            "Plant a seed at home and observe its growth, recording changes each week in a simple plant diary.",
            "Draw different types of flowers and label their parts together."
        ]
    },
    {
        "year_group": "Year 1",
        "key_stage": "KS1",
        "subject": "Science",
        "topic_title": "Animals, including Humans",
        "method_explanation": "Students identify and name various animals, including fish, amphibians, reptiles, birds, and mammals, and learn to classify animals by diet as carnivores, herbivores, or omnivores. They also explore the human body and senses.",
        "image_generated_by_dalle": "A simple drawing showing animals from different categories (fish, bird, mammal) and human body parts associated with each sense.",
        "interactive_activities": [
            "Create flashcards with pictures of animals and ask your child to classify them by type and diet (carnivore, herbivore, omnivore).",
            "Play a 'senses game' where your child guesses objects by touch, smell, or sound to learn about the five senses.",
            "Go on an animal-themed scavenger hunt, looking for pictures or toys of animals to classify."
        ]
    },
    {
        "year_group": "Year 1",
        "key_stage": "KS1",
        "subject": "Science",
        "topic_title": "Everyday Materials",
        "method_explanation": "Children learn to identify and name common materials like wood, plastic, glass, and metal and describe their basic properties (e.g., hard, soft, waterproof).",
        "image_generated_by_dalle": "An illustration showing everyday objects made from different materials, each labeled with material type.",
        "interactive_activities": [
            "Collect household items and discuss what they are made of, grouping items by material.",
            "Test objects for properties like waterproofing by placing them in water to see if they float or sink.",
            "Use building blocks to create structures and talk about why certain materials (like wood or plastic) are better for building than others."
        ]
    },
    {
        "year_group": "Year 1",
        "key_stage": "KS1",
        "subject": "Science",
        "topic_title": "Seasonal Changes",
        "method_explanation": "Students observe seasonal changes, focusing on how weather and daylight vary across the four seasons.",
        "image_generated_by_dalle": "A seasonal wheel showing changes in weather and daylight across winter, spring, summer, and autumn.",
        "interactive_activities": [
            "Keep a weather diary and draw pictures of what the sky looks like each day to observe changes over time.",
            "Discuss and observe how clothing and activities change with the seasons.",
            "Collect leaves in autumn and discuss why some trees lose their leaves while others don’t."
        ]
    },
    {
        "year_group": "Year 2",
        "key_stage": "KS1",
        "subject": "Science",
        "topic_title": "Living Things and Their Habitats",
        "method_explanation": "Students learn to differentiate between things that are living, dead, and never alive. They explore how animals and plants depend on their habitats, identify various plants and animals in different habitats, and understand simple food chains.",
        "image_generated_by_dalle": "Illustration showing a simple ecosystem with plants, animals, and a food chain, including arrows pointing from plants to herbivores and then to carnivores.",
        "interactive_activities": [
            "Go on a nature walk to identify plants and animals in different habitats and discuss what each one needs to survive.",
            "Create a chart of living, dead, and never-alive things found at home or in the garden.",
            "Build a simple food chain using pictures or drawings, like 'sun → plant → rabbit → fox,' and talk about who eats what."
        ]
    },
    {
        "year_group": "Year 2",
        "key_stage": "KS1",
        "subject": "Science",
        "topic_title": "Plants",
        "method_explanation": "Children observe how seeds and bulbs grow into mature plants, understanding that plants need water, light, and a suitable temperature to grow and stay healthy.",
        "image_generated_by_dalle": "An illustration of a plant life cycle, showing stages from seed to sprout to a fully grown plant with flowers.",
        "interactive_activities": [
            "Plant a seed or bulb in soil and track its growth over weeks, noting changes in size and leaf count.",
            "Set up a simple experiment with one plant in sunlight and another in shade, observing how they grow differently.",
            "Draw the parts of a plant and label the roots, stem, leaves, and flowers."
        ]
    },
    {
        "year_group": "Year 2",
        "key_stage": "KS1",
        "subject": "Science",
        "topic_title": "Animals, including Humans",
        "method_explanation": "Students learn that animals, including humans, have offspring that grow into adults. They also explore the basic needs for survival (water, food, air) and the importance of exercise, a balanced diet, and hygiene for good health.",
        "image_generated_by_dalle": "Illustration of a life cycle, such as egg → chick → chicken, and a simple representation of human needs: water, food, air, and exercise.",
        "interactive_activities": [
            "Talk about family photos showing stages of life (e.g., baby, toddler, child, adult) to understand growth.",
            "Set up a 'needs' chart with food, water, and air, discussing how each helps humans and animals survive.",
            "Do a fun exercise activity together, discussing why exercise keeps us healthy and how it helps our bodies."
        ]
    },
    {
        "year_group": "Year 2",
        "key_stage": "KS1",
        "subject": "Science",
        "topic_title": "Uses of Everyday Materials",
        "method_explanation": "Children identify and compare the uses of various everyday materials (wood, metal, plastic, etc.) and explore how the shapes of materials can be changed by squashing, bending, twisting, or stretching.",
        "image_generated_by_dalle": "Illustration of different materials like wood, metal, plastic, and examples of objects being squashed or bent.",
        "interactive_activities": [
            "Collect objects made of different materials and discuss why each material is used for its purpose (e.g., metal for tools).",
            "Experiment with materials to see which can be squashed, bent, or stretched and sort them by property.",
            "Draw or create a 'materials' poster by categorizing household items by their material and discussing properties like hardness and flexibility."
        ]
    },
    {
        "year_group": "Year 3",
        "key_stage": "KS2",
        "subject": "Science",
        "topic_title": "Plants",
        "method_explanation": "Students learn about the functions of different parts of flowering plants: roots, stem/trunk, leaves, and flowers. They explore what plants need for growth (light, air, water, nutrients) and how water is transported within plants, as well as pollination and seed dispersal.",
        "image_generated_by_dalle": "An illustration showing the parts of a plant with arrows indicating water transport from roots to leaves and flowers.",
        "interactive_activities": [
            "Conduct an experiment by growing plants with varying amounts of sunlight and water, observing how they grow differently.",
            "Place a white flower stem in colored water to show how water moves up through the plant.",
            "Collect seeds from various plants and discuss how they might be dispersed by wind, animals, or water."
        ]
    },
    {
        "year_group": "Year 3",
        "key_stage": "KS2",
        "subject": "Science",
        "topic_title": "Animals, including Humans",
        "method_explanation": "Children study nutrition and how animals (including humans) need the right amount of food to stay healthy. They also learn about skeletons and muscles for support, protection, and movement.",
        "image_generated_by_dalle": "Illustration of a skeleton with major muscles and simple food groups for balanced nutrition.",
        "interactive_activities": [
            "Create a 'balanced diet' plate with cut-out pictures of foods and discuss the importance of each food group.",
            "Explore movements like jumping or running, identifying which muscles and bones are involved.",
            "Discuss different animals’ skeletons and compare their structures to understand how they support movement."
        ]
    },
    {
        "year_group": "Year 3",
        "key_stage": "KS2",
        "subject": "Science",
        "topic_title": "Rocks",
        "method_explanation": "Students compare and group rocks based on appearance and physical properties, understand how fossils form in sedimentary rocks, and recognize how soil is made.",
        "image_generated_by_dalle": "Illustration showing different types of rocks and a simple diagram of fossil formation in sedimentary rock.",
        "interactive_activities": [
            "Go on a 'rock hunt' to collect different rocks and classify them by texture and color.",
            "Make a simple 'fossil' by pressing small objects like leaves into clay or plaster and letting it dry.",
            "Examine soil samples from different locations and identify visible components like sand, small rocks, or organic matter."
        ]
    },
    {
        "year_group": "Year 3",
        "key_stage": "KS2",
        "subject": "Science",
        "topic_title": "Light",
        "method_explanation": "Students learn that light is necessary to see and that it travels in straight lines. They also explore reflection, recognize that light from the sun can be dangerous, and investigate shadows.",
        "image_generated_by_dalle": "Illustration of light beams traveling in straight lines from a light source, with a mirror reflecting light and casting shadows.",
        "interactive_activities": [
            "Use a flashlight to create shadows with different objects, observing how the shadow size changes with distance.",
            "Place a mirror in sunlight and discuss how light reflects to create patterns.",
            "Create a sun safety poster together, discussing why we need to protect our eyes and skin from sunlight."
        ]
    },
    {
        "year_group": "Year 3",
        "key_stage": "KS2",
        "subject": "Science",
        "topic_title": "Forces and Magnets",
        "method_explanation": "Children learn about magnets, including magnetic forces, and that magnets can attract or repel each other and attract some materials. They explore magnetic poles and the use of magnets in everyday life.",
        "image_generated_by_dalle": "Illustration showing magnets with poles, magnetic fields, and examples of magnetic and non-magnetic materials.",
        "interactive_activities": [
            "Experiment with different magnets, observing which objects they attract and testing strength with different materials.",
            "Use a compass and discuss how it uses a magnetic field to point north.",
            "Set up a 'magnet maze' by guiding a small metal object through a path under a paper using a magnet."
        ]
    },
    {
        "year_group": "Year 4",
        "key_stage": "KS2",
        "subject": "Science",
        "topic_title": "Living Things and Their Habitats",
        "method_explanation": "Students explore classification by grouping plants and animals in various ways, using keys to identify species and learning how environmental changes affect living organisms.",
        "image_generated_by_dalle": "Illustration of a simple classification key with images of plants and animals grouped by characteristics.",
        "interactive_activities": [
            "Go on a nature walk to observe and identify different plants and animals using a simple classification key.",
            "Create a chart with groups like mammals, reptiles, flowering and non-flowering plants, and help your child categorize local species.",
            "Discuss examples of environmental changes (e.g., pollution) and their effects on local wildlife."
        ]
    },
    {
        "year_group": "Year 4",
        "key_stage": "KS2",
        "subject": "Science",
        "topic_title": "Animals, including Humans",
        "method_explanation": "Students learn about the human digestive system, the types and functions of teeth, and simple food chains that include producers, predators, and prey.",
        "image_generated_by_dalle": "Illustration showing parts of the digestive system, types of human teeth, and a simple food chain diagram.",
        "interactive_activities": [
            "Create a simple model of the digestive system using household items (e.g., tube for esophagus, plastic bag for stomach) and explain each part.",
            "Observe food chains in nature, discussing roles like producers and predators using local animals or plants.",
            "Compare herbivores' and carnivores' teeth by looking at pictures of animals or using plastic animal skull models."
        ]
    },
    {
        "year_group": "Year 4",
        "key_stage": "KS2",
        "subject": "Science",
        "topic_title": "States of Matter",
        "method_explanation": "Children learn to classify materials as solids, liquids, or gases, explore temperature-driven changes between these states, and study the water cycle, including evaporation and condensation.",
        "image_generated_by_dalle": "Diagram of the water cycle, showing stages of evaporation, condensation, and precipitation.",
        "interactive_activities": [
            "Use ice cubes and a hair dryer to show how solids become liquids, and boiling water to show evaporation into gas.",
            "Observe condensation on a cold glass and discuss how it mirrors the water cycle.",
            "Measure the time it takes for water to evaporate under different conditions (sunny, cloudy) and track findings in a chart."
        ]
    },
    {
        "year_group": "Year 4",
        "key_stage": "KS2",
        "subject": "Science",
        "topic_title": "Electricity",
        "method_explanation": "Students build simple circuits with batteries, wires, bulbs, and switches, learning about conductors and insulators and how circuits work.",
        "image_generated_by_dalle": "A simple circuit diagram showing a battery, switch, and bulb with conductor and insulator examples.",
        "interactive_activities": [
            "Create a simple circuit using a battery, bulb, and switch, testing different materials to identify conductors and insulators.",
            "Experiment with adding and removing components in a circuit to see how it affects the bulb's brightness.",
            "Draw a simple circuit diagram together, labeling parts like the battery and bulb to reinforce understanding."
        ]
    }
]